# MaterialApi

All URIs are relative to *http://localhost*

Method | Description
------------- | -------------
**add_bolt_assembly** | Add bolt assembly to the project. Accepted names come from  &#x60;GET .../materials/bolt-assemblies/library&#x60;.
**add_cross_section** | Adds a library cross-section (by its MPRL name and material) to the project.
**add_material_bolt_grade** | Adds a material to the project.
**add_material_concrete** | Adds a material to the project.
**add_material_headed_stud_grade** | Adds a material to the project.
**add_material_reinforcement** | Adds a material to the project.
**add_material_steel** | Adds a material to the project.
**add_material_weld** | Adds a material to the project.
**add_parametric_cross_section** | Creates a parametric cross-section (welded, boxed, cold-formed, parametric rolled)  from its shape type and dimensions. Dimension ids are the stable parameter ids the  section GET exposes; dimensions not named keep the shape&#39;s defaults.
**add_pin** | Add pin to the project. Pins are available only for the ECEN design code; list the accepted  names via &#x60;GET .../materials/pin/library&#x60;.
**get_all_materials** | Gets materials used in the specified project.
**get_bolt_assemblies** | Gets bolt assemblies used in the specified project.
**get_bolt_grade_materials** | Gets materials used in the specified project.
**get_concrete_materials** | Gets materials used in the specified project.
**get_cross_section** | Gets one cross-section of the project: the same object the listing returns for it.
**get_cross_section_geometry** | Gets the evaluated outline geometry of one cross-section: per component the closed  outline and the openings as ordered chains of line/arc segments, with the material the  component is made of.
**get_cross_sections** | Gets the cross-sections of the project: id, display name and the definition of each  (library / parametric / custom). The evaluated outline of a section is served by  &#x60;cross-sections/{cssId}/geometry&#x60;.
**get_headed_stud_grade_materials** | Gets materials used in the specified project.
**get_material_library** | Lists the MPRL names available in the material library for the project&#39;s design code.
**get_parametric_cross_section_shape_template** | The fill-in template of a parametric shape: every dimension with its stable id, its  stable code name (e.g. \&quot;wH\&quot;) and the shape&#39;s default value, in SI units. Change the  values you care about, set the material, and POST it to  &#x60;cross-sections/parametric&#x60;.
**get_parametric_cross_section_shapes** | Lists the shape types the parametric cross-section endpoints accept (e.g. \&quot;Iw\&quot;, \&quot;Tw\&quot;,  \&quot;CHSPar\&quot;). Get a shape&#39;s fill-in template from  &#x60;cross-sections/parametric/shapes/{shapeType}&#x60;.
**get_pins** | Gets pins used in the specified project.
**get_reinforcement_materials** | Gets materials used in the specified project.
**get_steel_materials** | Gets materials used in the specified project.
**get_welding_materials** | Gets materials used in the specified project.
**update_parametric_cross_section** | Replaces the definition of parametric cross-section cssId with the  given one — a full replacement: dimensions not named revert to the shape&#39;s defaults,  so send the complete definition obtained from the section GET. Answers 409 when the id  stores a library or general section.

<a id="add_bolt_assembly"></a>
# **add_bolt_assembly**
> object add_bolt_assembly(project_id, con_mprl_element=con_mprl_element)

Add bolt assembly to the project. Accepted names come from  `GET .../materials/bolt-assemblies/library`.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of a new bolt assemby to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_bolt_assemblyExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of a new bolt assemby to be added to the project. (optional)

    try:
        # Add bolt assembly to the project. Accepted names come from  `GET .../materials/bolt-assemblies/library`.
        api_response = api_client.material.add_bolt_assembly(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_bolt_assembly:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_bolt_assembly: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/bolt-assemblies

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_cross_section"></a>
# **add_cross_section**
> ConCrossSection add_cross_section(project_id, con_mprl_cross_section=con_mprl_cross_section)

Adds a library cross-section (by its MPRL name and material) to the project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_cross_section** | **ConMprlCrossSection**| MPRL name and material of the new cross-section. | [optional]

### Return type

**ConCrossSection**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_cross_section import ConCrossSection
from ideastatica_connection_api.models.con_mprl_cross_section import ConMprlCrossSection
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_cross_sectionExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_cross_section = ideastatica_connection_api.ConMprlCrossSection() # ConMprlCrossSection | MPRL name and material of the new cross-section. (optional)

    try:
        # Adds a library cross-section (by its MPRL name and material) to the project.
        api_response = api_client.material.add_cross_section(project_id, con_mprl_cross_section=con_mprl_cross_section)
        print("The response of MaterialApi->add_cross_section:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_cross_section: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/cross-sections

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_material_bolt_grade"></a>
# **add_material_bolt_grade**
> object add_material_bolt_grade(project_id, con_mprl_element=con_mprl_element)

Adds a material to the project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of the new material to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_material_bolt_gradeExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of the new material to be added to the project. (optional)

    try:
        # Adds a material to the project.
        api_response = api_client.material.add_material_bolt_grade(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_material_bolt_grade:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_material_bolt_grade: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/bolt-grade

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_material_concrete"></a>
# **add_material_concrete**
> object add_material_concrete(project_id, con_mprl_element=con_mprl_element)

Adds a material to the project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of the new material to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_material_concreteExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of the new material to be added to the project. (optional)

    try:
        # Adds a material to the project.
        api_response = api_client.material.add_material_concrete(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_material_concrete:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_material_concrete: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/concrete

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_material_headed_stud_grade"></a>
# **add_material_headed_stud_grade**
> object add_material_headed_stud_grade(project_id, con_mprl_element=con_mprl_element)

Adds a material to the project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of the new material to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_material_headed_stud_gradeExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of the new material to be added to the project. (optional)

    try:
        # Adds a material to the project.
        api_response = api_client.material.add_material_headed_stud_grade(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_material_headed_stud_grade:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_material_headed_stud_grade: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/headed-stud-grade

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_material_reinforcement"></a>
# **add_material_reinforcement**
> object add_material_reinforcement(project_id, con_mprl_element=con_mprl_element)

Adds a material to the project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of the new material to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_material_reinforcementExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of the new material to be added to the project. (optional)

    try:
        # Adds a material to the project.
        api_response = api_client.material.add_material_reinforcement(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_material_reinforcement:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_material_reinforcement: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/reinforcement

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_material_steel"></a>
# **add_material_steel**
> object add_material_steel(project_id, con_mprl_element=con_mprl_element)

Adds a material to the project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of the new material to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_material_steelExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of the new material to be added to the project. (optional)

    try:
        # Adds a material to the project.
        api_response = api_client.material.add_material_steel(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_material_steel:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_material_steel: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/steel

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_material_weld"></a>
# **add_material_weld**
> object add_material_weld(project_id, con_mprl_element=con_mprl_element)

Adds a material to the project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of the new material to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_material_weldExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of the new material to be added to the project. (optional)

    try:
        # Adds a material to the project.
        api_response = api_client.material.add_material_weld(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_material_weld:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_material_weld: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/welding

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_parametric_cross_section"></a>
# **add_parametric_cross_section**
> ConCrossSection add_parametric_cross_section(project_id, con_cross_section_parametric_definition=con_cross_section_parametric_definition)

Creates a parametric cross-section (welded, boxed, cold-formed, parametric rolled)  from its shape type and dimensions. Dimension ids are the stable parameter ids the  section GET exposes; dimensions not named keep the shape's defaults.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_cross_section_parametric_definition** | **ConCrossSectionParametricDefinition**| Shape type, dimensions and material of the new cross-section. | [optional]

### Return type

**ConCrossSection**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_cross_section import ConCrossSection
from ideastatica_connection_api.models.con_cross_section_parametric_definition import ConCrossSectionParametricDefinition
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_parametric_cross_sectionExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_cross_section_parametric_definition = ideastatica_connection_api.ConCrossSectionParametricDefinition() # ConCrossSectionParametricDefinition | Shape type, dimensions and material of the new cross-section. (optional)

    try:
        # Creates a parametric cross-section (welded, boxed, cold-formed, parametric rolled)  from its shape type and dimensions. Dimension ids are the stable parameter ids the  section GET exposes; dimensions not named keep the shape's defaults.
        api_response = api_client.material.add_parametric_cross_section(project_id, con_cross_section_parametric_definition=con_cross_section_parametric_definition)
        print("The response of MaterialApi->add_parametric_cross_section:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_parametric_cross_section: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/cross-sections/parametric

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="add_pin"></a>
# **add_pin**
> object add_pin(project_id, con_mprl_element=con_mprl_element)

Add pin to the project. Pins are available only for the ECEN design code; list the accepted  names via `GET .../materials/pin/library`.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **con_mprl_element** | **ConMprlElement**| Definition of a new pin to be added to the project. | [optional]

### Return type

**object**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_mprl_element import ConMprlElement
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_pinExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    con_mprl_element = ideastatica_connection_api.ConMprlElement() # ConMprlElement | Definition of a new pin to be added to the project. (optional)

    try:
        # Add pin to the project. Pins are available only for the ECEN design code; list the accepted  names via `GET .../materials/pin/library`.
        api_response = api_client.material.add_pin(project_id, con_mprl_element=con_mprl_element)
        print("The response of MaterialApi->add_pin:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->add_pin: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/materials/pin

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_all_materials"></a>
# **get_all_materials**
> List[object] get_all_materials(project_id)

Gets materials used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_all_materialsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets materials used in the specified project.
        api_response = api_client.material.get_all_materials(project_id)
        print("The response of MaterialApi->get_all_materials:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_all_materials: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_bolt_assemblies"></a>
# **get_bolt_assemblies**
> List[object] get_bolt_assemblies(project_id)

Gets bolt assemblies used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_bolt_assembliesExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets bolt assemblies used in the specified project.
        api_response = api_client.material.get_bolt_assemblies(project_id)
        print("The response of MaterialApi->get_bolt_assemblies:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_bolt_assemblies: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/bolt-assemblies

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_bolt_grade_materials"></a>
# **get_bolt_grade_materials**
> List[object] get_bolt_grade_materials(project_id)

Gets materials used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_bolt_grade_materialsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets materials used in the specified project.
        api_response = api_client.material.get_bolt_grade_materials(project_id)
        print("The response of MaterialApi->get_bolt_grade_materials:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_bolt_grade_materials: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/bolt-grade

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_concrete_materials"></a>
# **get_concrete_materials**
> List[object] get_concrete_materials(project_id)

Gets materials used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_concrete_materialsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets materials used in the specified project.
        api_response = api_client.material.get_concrete_materials(project_id)
        print("The response of MaterialApi->get_concrete_materials:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_concrete_materials: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/concrete

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_cross_section"></a>
# **get_cross_section**
> ConCrossSection get_cross_section(project_id, css_id)

Gets one cross-section of the project: the same object the listing returns for it.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **css_id** | **int**| Id of the cross-section in the project. |

### Return type

**ConCrossSection**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_cross_section import ConCrossSection
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_cross_sectionExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    css_id = 56 # int | Id of the cross-section in the project.

    try:
        # Gets one cross-section of the project: the same object the listing returns for it.
        api_response = api_client.material.get_cross_section(project_id, css_id)
        print("The response of MaterialApi->get_cross_section:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_cross_section: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/cross-sections/{cssId}

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_cross_section_geometry"></a>
# **get_cross_section_geometry**
> ConCrossSectionGeometry get_cross_section_geometry(project_id, css_id)

Gets the evaluated outline geometry of one cross-section: per component the closed  outline and the openings as ordered chains of line/arc segments, with the material the  component is made of.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **css_id** | **int**| Id of the cross-section in the project. |

### Return type

**ConCrossSectionGeometry**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_cross_section_geometry import ConCrossSectionGeometry
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_cross_section_geometryExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    css_id = 56 # int | Id of the cross-section in the project.

    try:
        # Gets the evaluated outline geometry of one cross-section: per component the closed  outline and the openings as ordered chains of line/arc segments, with the material the  component is made of.
        api_response = api_client.material.get_cross_section_geometry(project_id, css_id)
        print("The response of MaterialApi->get_cross_section_geometry:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_cross_section_geometry: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/cross-sections/{cssId}/geometry

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_cross_sections"></a>
# **get_cross_sections**
> List[ConCrossSection] get_cross_sections(project_id)

Gets the cross-sections of the project: id, display name and the definition of each  (library / parametric / custom). The evaluated outline of a section is served by  `cross-sections/{cssId}/geometry`.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

[**List[ConCrossSection]**](ConCrossSection.md)

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_cross_section import ConCrossSection
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_cross_sectionsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets the cross-sections of the project: id, display name and the definition of each  (library / parametric / custom). The evaluated outline of a section is served by  `cross-sections/{cssId}/geometry`.
        api_response = api_client.material.get_cross_sections(project_id)
        print("The response of MaterialApi->get_cross_sections:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_cross_sections: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/cross-sections

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_headed_stud_grade_materials"></a>
# **get_headed_stud_grade_materials**
> List[object] get_headed_stud_grade_materials(project_id)

Gets materials used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_headed_stud_grade_materialsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets materials used in the specified project.
        api_response = api_client.material.get_headed_stud_grade_materials(project_id)
        print("The response of MaterialApi->get_headed_stud_grade_materials:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_headed_stud_grade_materials: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/headed-stud-grade

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_material_library"></a>
# **get_material_library**
> List[str] get_material_library(project_id, material_type)

Lists the MPRL names available in the material library for the project's design code.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **material_type** | **str**| Material type to list (steel, concrete, bolt-grade, welding, headed-stud-grade, reinforcement, pin, cross-sections, bolt-assemblies). |

### Return type

**List[str]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_material_libraryExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    material_type = 'material_type_example' # str | Material type to list (steel, concrete, bolt-grade, welding, headed-stud-grade, reinforcement, pin, cross-sections, bolt-assemblies).

    try:
        # Lists the MPRL names available in the material library for the project's design code.
        api_response = api_client.material.get_material_library(project_id, material_type)
        print("The response of MaterialApi->get_material_library:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_material_library: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/{materialType}/library

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_parametric_cross_section_shape_template"></a>
# **get_parametric_cross_section_shape_template**
> ConCrossSectionParametricDefinition get_parametric_cross_section_shape_template(project_id, shape_type)

The fill-in template of a parametric shape: every dimension with its stable id, its  stable code name (e.g. \"wH\") and the shape's default value, in SI units. Change the  values you care about, set the material, and POST it to  `cross-sections/parametric`.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **shape_type** | **str**| Shape type name from &#x60;cross-sections/parametric/shapes&#x60;. |

### Return type

**ConCrossSectionParametricDefinition**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_cross_section_parametric_definition import ConCrossSectionParametricDefinition
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_parametric_cross_section_shape_templateExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    shape_type = 'shape_type_example' # str | Shape type name from `cross-sections/parametric/shapes`.

    try:
        # The fill-in template of a parametric shape: every dimension with its stable id, its  stable code name (e.g. \"wH\") and the shape's default value, in SI units. Change the  values you care about, set the material, and POST it to  `cross-sections/parametric`.
        api_response = api_client.material.get_parametric_cross_section_shape_template(project_id, shape_type)
        print("The response of MaterialApi->get_parametric_cross_section_shape_template:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_parametric_cross_section_shape_template: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/cross-sections/parametric/shapes/{shapeType}

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_parametric_cross_section_shapes"></a>
# **get_parametric_cross_section_shapes**
> List[str] get_parametric_cross_section_shapes(project_id)

Lists the shape types the parametric cross-section endpoints accept (e.g. \"Iw\", \"Tw\",  \"CHSPar\"). Get a shape's fill-in template from  `cross-sections/parametric/shapes/{shapeType}`.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[str]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_parametric_cross_section_shapesExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Lists the shape types the parametric cross-section endpoints accept (e.g. \"Iw\", \"Tw\",  \"CHSPar\"). Get a shape's fill-in template from  `cross-sections/parametric/shapes/{shapeType}`.
        api_response = api_client.material.get_parametric_cross_section_shapes(project_id)
        print("The response of MaterialApi->get_parametric_cross_section_shapes:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_parametric_cross_section_shapes: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/cross-sections/parametric/shapes

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_pins"></a>
# **get_pins**
> List[object] get_pins(project_id)

Gets pins used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_pinsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets pins used in the specified project.
        api_response = api_client.material.get_pins(project_id)
        print("The response of MaterialApi->get_pins:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_pins: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/pin

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_reinforcement_materials"></a>
# **get_reinforcement_materials**
> List[object] get_reinforcement_materials(project_id)

Gets materials used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_reinforcement_materialsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets materials used in the specified project.
        api_response = api_client.material.get_reinforcement_materials(project_id)
        print("The response of MaterialApi->get_reinforcement_materials:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_reinforcement_materials: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/reinforcement

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_steel_materials"></a>
# **get_steel_materials**
> List[object] get_steel_materials(project_id)

Gets materials used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_steel_materialsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets materials used in the specified project.
        api_response = api_client.material.get_steel_materials(project_id)
        print("The response of MaterialApi->get_steel_materials:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_steel_materials: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/steel

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_welding_materials"></a>
# **get_welding_materials**
> List[object] get_welding_materials(project_id)

Gets materials used in the specified project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |

### Return type

**List[object]**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_welding_materialsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.

    try:
        # Gets materials used in the specified project.
        api_response = api_client.material.get_welding_materials(project_id)
        print("The response of MaterialApi->get_welding_materials:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->get_welding_materials: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/materials/welding

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="update_parametric_cross_section"></a>
# **update_parametric_cross_section**
> ConCrossSection update_parametric_cross_section(project_id, css_id, con_cross_section_parametric_definition=con_cross_section_parametric_definition)

Replaces the definition of parametric cross-section cssId with the  given one — a full replacement: dimensions not named revert to the shape's defaults,  so send the complete definition obtained from the section GET. Answers 409 when the id  stores a library or general section.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project in the ConnectionRestApi service. |
 **css_id** | **int**| Id of the parametric cross-section to replace. |
 **con_cross_section_parametric_definition** | **ConCrossSectionParametricDefinition**| Shape type, dimensions and material replacing the stored definition. | [optional]

### Return type

**ConCrossSection**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_cross_section import ConCrossSection
from ideastatica_connection_api.models.con_cross_section_parametric_definition import ConCrossSectionParametricDefinition
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def update_parametric_cross_sectionExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project in the ConnectionRestApi service.
    css_id = 56 # int | Id of the parametric cross-section to replace.
    con_cross_section_parametric_definition = ideastatica_connection_api.ConCrossSectionParametricDefinition() # ConCrossSectionParametricDefinition | Shape type, dimensions and material replacing the stored definition. (optional)

    try:
        # Replaces the definition of parametric cross-section cssId with the  given one — a full replacement: dimensions not named revert to the shape's defaults,  so send the complete definition obtained from the section GET. Answers 409 when the id  stores a library or general section.
        api_response = api_client.material.update_parametric_cross_section(project_id, css_id, con_cross_section_parametric_definition=con_cross_section_parametric_definition)
        print("The response of MaterialApi->update_parametric_cross_section:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling MaterialApi->update_parametric_cross_section: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **PUT** /api/5/projects/{projectId}/materials/cross-sections/parametric/{cssId}

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**409** | Conflict |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)